import re

sn_encoding_rules = {
    # 集尘桶成品 anker 编码 AAMA060F14400001 、 AE6A060F32400001前6位固定
    "001": [r"A([0-9A-Z]){2}A06\d([0-9A-Z]){4}\d{5}"],
    # 前撞组件 料号+线体+日期+流水码 H481500000236XX-Q01-250220-00001
    "003": [r"H481500000236XX-Q\d{2}-(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])-\d{5}",
            r"H481500000597XX-Q\d{2}-(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])-\d{5}"],
    # "front_pcb" 前撞组件PCB(C10项目): 越南，白色，黑色款
    "004": [r"DGH121100001330(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{6}",
            r"DGH121100001930(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{6}",
            r"YNH121100001330(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{6}"],
    # 海能地检组件 H481500000137XX-D01-250221-00001 料号+线体+日期+流水码
    "005": [r"H481500000137XX-D\d{2}-(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])-\d{5}"],
    # 海能集尘桶PCBA (C10) DGH121100001435250327001948
    "006": [r"DGH121100001435(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{6}",
            r"YNH121100001435(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{6}"],
    # 007 静态电流测试，主机条码
    # "007": [r"AAMA00\d([0-9A-F]){4}\d{5}", r"AEDA00\d([0-9A-F]){4}\d{5}"],
    # AE6A000F32400001
    "007": [r"A([0-9A-Z]){2}A00\d([0-9A-Z]){4}\d{5}"],
    # 艾格尔左轮组件; AGEC10L25021500001 (C10项目)
    "010": [r"^AGEC10L\d{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{5}$"],
    # 艾格尔右轮组件; AGEC10R25021500001 (C10项目)
    "011": [r"^AGEC10R\d{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{5}$"],
    # 艾格尔边刷摆臂组件; AGEC10S25021500001 (C10项目)
    "012": [r"^AGEC10S\d{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{5}$"],
    # 艾格尔中扫组件; AGEC10Z25021500001 (C10项目)
    "013": [r"^AGEC10Z\d{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{5}$"],
    # 打高压测试，集尘桶 同 ”001“
    # AE6A060F32400001
    # "101": [r"AAMA06([0-9A-F]){4}\d{5}", r"AEDA06([0-9A-F]){4}\d{5}"],
    "101": [r"A([0-9A-Z]){2}A06\d([0-9A-Z]){4}\d{5}"],
    # 打高压测试，集尘桶 同 ”001“
    # "104": [r"AAMA06([0-9A-F]){4}\d{5}", r"AEDA06([0-9A-F]){4}\d{5}"],
    # AE6A060F32400001
    "104": [r"A([0-9A-Z]){2}A06\d([0-9A-Z]){4}\d{5}"],
    # "bat"; AGEC10S25021500001 (C10项目)
    "bat": [r"^C0914J1C2\d{2}[1-9A-C][0-9A-F]{5}\d{4}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])$"],
    # 前撞组件 同 003  料号+线体+日期+流水码 H481500000236XX-Q01-250220-00001
    "front": [r"H481500000236XX-Q\d{2}-(\d{2})(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])-\d{5}"],
    # "robot" 主机: AAMA000F14200001 , 同 "007"
    "robot": [r"AAMA00\d([0-9A-F]){4}\d{5}", r"AEDA00\d([0-9A-F]){4}\d{5}"],

}


# 匹配不到返回 False ，匹配成功或匹配不到（匹配不到任务不需要限制）返回 Ture,
def match_sn_encoding_rules(dev="001", sn=""):
    rules = sn_encoding_rules.get(dev)
    print(rules)
    if rules:
        for rule in rules:
            if re.match(rule, sn):
                return True
#        return False
    
    return True


def check_barcode(sn="", sn_type=""):
    if sn_type == "bat":
        ret = bat_sn_check(sn)
    elif sn_type == "front":
        ret = front_sn_check(sn)
    else:
        ret = False
    return ret


def bat_sn_check(sn=""):
    print("sn:", sn)
    print("len= ", str(len(sn)))
    if len(sn) != 25:
        return False
    if sn[0:7] != "C0914J1":
        return False
    if sn[7:9] != "C2":
        return False

    return True


def front_sn_check(sn=""):
    if len(sn) != 32:
        return False
    if sn[0:13] != "H481500000236":
        return False

    return True







